Results/1Singularity/resultsMEM.txt
sysbench 1.0.18 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 32MiB each
4GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      429.96
    writes/s:                     286.64
    fsyncs/s:                     917.26

Throughput:
    read, MiB/s:                  6.72
    written, MiB/s:               4.48

General statistics:
    total time:                          120.1453s
    total number of events:              196181

Latency (ms):
         min:                                    0.00
         avg:                                    0.61
         max:                                   45.48
         95th percentile:                        3.49
         sum:                               119726.47

Threads fairness:
    events (avg/stddev):           196181.0000/0.00
    execution time (avg/stddev):   119.7265/0.00